src/cf/Catalogs/уатПрофилиОбменаСВнешнимиСистемами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатПрофилиОбменаСВнешнимиСистемами</Name>
			<Comment>(уат)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлубинаПоискаПЛДоВыезда</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлубинаПоискаПЛПослеВозвращения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаменятьАналогНаОсновноеТопливо</Name>
					<Comment>Заменять аналог на основное топливо (уат)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментироватьХодВыполнения</Name>
					<Comment>(уат)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбрабатыватьРассчитанныеПутевыеЛисты</Name>
					<Comment>(уат)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрыватьФормыЗаписанныхЗаправок</Name>
					<Comment>(уат)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПересчитатьПутевыеЛисты</Name>
					<Comment>(уат)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьНаличиеДублейПоСозданнымРанееДокументам</Name>
					<Comment>(уат)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводитьСозданныеЗаправкиГСМ</Name>
					<Comment>(уат)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСистемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатТипыВнешнихСистем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСоответствияКолонок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоПроверенные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНаценкиСкидки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОбработкиЗаправок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОбработкиСливов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСоздаватьСливыДляОтрицательныхЗаправок</Name>
					<Comment>(уат)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоответствиеКолонок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КолонкаДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяКолонкиФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолонкаДокументаПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКолонкиФайла</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользованиеВсегда</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/уатТипыВнешнихСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатТипыВнешнихСистем</Name>
			<Comment>Типы внешних систем (уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СистемаМониторинга</Name>
					<Comment>Система мониторинга.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцессинговыйЦентр</Name>
					<Comment>Процессинговый центр.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемаВзиманияПлаты</Name>
					<Comment>Система взимания платы.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервисШтрафов</Name>
					<Comment>Сервис штрафов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервисПарковок</Name>
					<Comment>Сервис парковок</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервисСтрахования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервисГеоданных</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/уатПрофилиОбменаСВнешнимиСистемами/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выполняет заполнение предопределенных элементов справочника
//
Процедура ЗаполнитьПредопределенныеДанные() Экспорт
	
	СпрОбъект = Справочники.уатПрофилиОбменаСВнешнимиСистемами.Газпромнефть.ПолучитьОбъект();
	СпрОбъект.ТипСистемы = Перечисления.уатТипыВнешнихСистем.ПроцессинговыйЦентр;
	СпрОбъект.ВнешняяСистема = Справочники.уатВнешниеСистемы.Газпромнефть;
	ИнициализацияСоответствияКолонок(СпрОбъект);
	ИнициализацияСоответствияКолонокГазпромнефть(СпрОбъект);
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатПрофилиОбменаСВнешнимиСистемами.ППР.ПолучитьОбъект();
	СпрОбъект.ТипСистемы = Перечисления.уатТипыВнешнихСистем.ПроцессинговыйЦентр;
	СпрОбъект.ВнешняяСистема = Справочники.уатВнешниеСистемы.ППР;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатПрофилиОбменаСВнешнимиСистемами.Лукойл.ПолучитьОбъект();
	СпрОбъект.ТипСистемы = Перечисления.уатТипыВнешнихСистем.ПроцессинговыйЦентр;
	СпрОбъект.ВнешняяСистема = Справочники.уатВнешниеСистемы.ЛукойлЛИКАРД;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатПрофилиОбменаСВнешнимиСистемами.Роснефть.ПолучитьОбъект();
	СпрОбъект.ТипСистемы = Перечисления.уатТипыВнешнихСистем.ПроцессинговыйЦентр;
	СпрОбъект.ВнешняяСистема = Справочники.уатВнешниеСистемы.Роснефть;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатПрофилиОбменаСВнешнимиСистемами.ПлатонВыпискаОпераций.ПолучитьОбъект();
	СпрОбъект.ТипСистемы = Перечисления.уатТипыВнешнихСистем.СистемаВзиманияПлаты;
	СпрОбъект.ВнешняяСистема = Справочники.уатВнешниеСистемы.Платон;
	СпрОбъект.ТипСоответствияКолонок = 1;
	ИнициализацияСоответствияКолонок(СпрОбъект);
	ИнициализацияСоответствияКолонокПлатонВыпискаОпераций(СпрОбъект);
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатПрофилиОбменаСВнешнимиСистемами.ПлатонЛогистическийОтчет.ПолучитьОбъект();
	СпрОбъект.ТипСистемы = Перечисления.уатТипыВнешнихСистем.СистемаВзиманияПлаты;
	СпрОбъект.ВнешняяСистема = Справочники.уатВнешниеСистемы.Платон;
	СпрОбъект.ТипСоответствияКолонок = 1;
	ИнициализацияСоответствияКолонок(СпрОбъект);
	ИнициализацияСоответствияКолонокПлатонЛогистическийОтчет(СпрОбъект);
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатПрофилиОбменаСВнешнимиСистемами.Автодор.ПолучитьОбъект();
	СпрОбъект.ТипСистемы = Перечисления.уатТипыВнешнихСистем.СистемаВзиманияПлаты;
	СпрОбъект.ВнешняяСистема = Справочники.уатВнешниеСистемы.Автодор;
	СпрОбъект.ТипСоответствияКолонок = 1;
	ИнициализацияСоответствияКолонок(СпрОбъект);
	ИнициализацияСоответствияКолонокАвтодор(СпрОбъект);
	СпрОбъект.Записать();
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализацияСоответствияКолонок(Объект) Экспорт
	
	Объект.СоответствиеКолонок.Очистить();
	Если Объект.ТипСистемы = Перечисления.уатТипыВнешнихСистем.ПроцессинговыйЦентр Тогда
		ИнициализацияСоответствияКолонокПЦ(Объект);
	ИначеЕсли Объект.ТипСистемы = Перечисления.уатТипыВнешнихСистем.СистемаВзиманияПлаты Тогда
		ИнициализацияСоответствияКолонокСистемаВзиманияПлаты(Объект);
	ИначеЕсли Объект.ТипСистемы = Перечисления.уатТипыВнешнихСистем.СервисСтрахования Тогда
		ИнициализацияСоответствияКолонокСервисСтрахования(Объект);
	КонецЕсли;
КонецПроцедуры

Процедура ИнициализацияСоответствияКолонокСервисСтрахования(Объект) Экспорт

	НоваяСтрока = Объект.СоответствиеКолонок.Добавить();
	НоваяСтрока.КолонкаДокумента = "ВходящийНомер";
	НоваяСтрока.КолонкаДокументаПредставление = "Вх.номер по данным контрагента";
	НоваяСтрока.Использование = Истина;
	
	НоваяСтрока = Объект.СоответствиеКолонок.Добавить();
	НоваяСтрока.КолонкаДокумента = "ДатаВходящегоДокумента";
	НоваяСтрока.КолонкаДокументаПредставление = "Вх.дата по данным контрагента";
	НоваяСтрока.Использование = Истина;
	
	НоваяСтрока = Объект.СоответствиеКолонок.Добавить();
	НоваяСтрока.КолонкаДокумента = "Сумма";
	НоваяСтрока.КолонкаДокументаПредставление = "Страховая премия по данным контрагента";
	
	НоваяСтрока = Объект.СоответствиеКолонок.Добавить();
	НоваяСтрока.КолонкаДокумента = "Валюта";
	НоваяСтрока.КолонкаДокументаПредставление = "Валюта по данным контрагента";
	НоваяСтрока.Использование = Истина;
	
КонецПроцедуры

Процедура ИнициализацияСоответствияКолонокПЦ(Объект)

	НоваяСтрока = Объект.СоответствиеКолонок.Добавить();
	НоваяСтрока.КолонкаДокумента = "Дата";
	НоваяСтрока.КолонкаДокументаПредставление = Нстр("en = 'Date'; ru = 'Дата'");
	НоваяСтрока.Использование = Истина;
	
	НоваяСтрока = Объект.СоответствиеКолонок.Добавить();
	НоваяСтрока.КолонкаДокумента = "Время";
	НоваяСтрока.КолонкаДокументаПредставление = Нстр("en = 'Time'; ru = 'Время'");
	НоваяСтрока.Использование = Истина;
	
	НоваяСтрока = Объект.СоответствиеКолонок.Добавить();
	НоваяСтрока.КолонкаДокумента = "НоменклатураОтчета";
	НоваяСтрока.КолонкаДокументаПредставление = Нстр("en = 'Fuel (per report)'; ru = 'Номенклатура ГСМ (по отчету)'");
	
	НоваяСтрока = Объект.СоответствиеКолонок.Добавить();
	НоваяСтрока.КолонкаДокумента = "ПластиковаяКартаОтчета";
	НоваяСтрока.КолонкаДокументаПредставление = Нстр("en = 'Plastic card (per report)'; ru = 'Пластиковая карта (по отчету)'");
	НоваяСтрока.Использование = Истина;
	
	НоваяСтрока = Объект.СоответствиеКолонок.Добавить();
	НоваяСтрока.КолонкаДокумента = "Количество";
	НоваяСтрока.КолонкаДокументаПредставление = Нстр("en = 'Quantity'; ru = 'Количество'");
	
	НоваяСтрока = Объект.СоответствиеКолонок.Добавить();
	НоваяСтрока.КолонкаДокумента = "Сумма";
	НоваяСтрока.КолонкаДокументаПредставление = Нстр("en = 'Amount'; ru = 'Сумма'");
	
	НоваяСтрока = Объект.СоответствиеКолонок.Добавить();
	НоваяСтрока.КолонкаДокумента = "СтавкаНДС";
	НоваяСтрока.КолонкаДокументаПредставление = Нстр("en = 'VAT rate'; ru = 'Ставка НДС'");
	
	НоваяСтрока = Объект.СоответствиеКолонок.Добавить();
	НоваяСтрока.КолонкаДокумента = "СуммаНДС";
	НоваяСтрока.КолонкаДокументаПредставление = Нстр("en = 'VAT amount'; ru = 'Сумма НДС'");
	
	НоваяСтрока = Объект.СоответствиеКолонок.Добавить();
	НоваяСтрока.КолонкаДокумента = "МестоЗаправкиКод";
	НоваяСтрока.КолонкаДокументаПредставление = Нстр("en = 'Refueling location (Code)'; ru = 'Место заправки (код)'");
	
	НоваяСтрока = Объект.СоответствиеКолонок.Добавить();
	НоваяСтрока.КолонкаДокумента = "МестоЗаправкиНаименование";
	НоваяСтрока.КолонкаДокументаПредставление = Нстр("en = 'Refueling location (Name)'; ru = 'Место заправки (наименование)'");

КонецПроцедуры

Процедура ИнициализацияСоответствияКолонокГазпромнефть(Объект) Экспорт

	Для Каждого ТекСтрока Из Объект.СоответствиеКолонок Цикл
		Если ТекСтрока.КолонкаДокумента = "Дата" Тогда
			ТекСтрока.Использование		 = Истина;
			ТекСтрока.НомерКолонкиФайла	 = 5;
			ТекСтрока.ИмяКолонкиФайла	 = "Дата транзакции";
		ИначеЕсли ТекСтрока.КолонкаДокумента = "Время" Тогда
			ТекСтрока.Использование		 = Истина;
			ТекСтрока.НомерКолонкиФайла	 = 6;
			ТекСтрока.ИмяКолонкиФайла	 = "Время транзакции";
		ИначеЕсли ТекСтрока.КолонкаДокумента = "НоменклатураОтчета" Тогда
			ТекСтрока.Использование		 = Истина;
			ТекСтрока.НомерКолонкиФайла	 = 10;
			ТекСтрока.ИмяКолонкиФайла	 = "Товар";
		ИначеЕсли ТекСтрока.КолонкаДокумента = "ПластиковаяКартаОтчета" Тогда
			ТекСтрока.Использование		 = Истина;
			ТекСтрока.НомерКолонкиФайла	 = 1;
			ТекСтрока.ИмяКолонкиФайла	 = "Номер карты";
		ИначеЕсли ТекСтрока.КолонкаДокумента = "Количество" Тогда
			ТекСтрока.Использование		 = Истина;
			ТекСтрока.НомерКолонкиФайла	 = 11;
			ТекСтрока.ИмяКолонкиФайла	 = "Количество";
		ИначеЕсли ТекСтрока.КолонкаДокумента = "Сумма" Тогда
			ТекСтрока.Использование		 = Истина;
			ТекСтрока.НомерКолонкиФайла	 = 18;
			ТекСтрока.ИмяКолонкиФайла	 = "Сумма к оплате";
		ИначеЕсли ТекСтрока.КолонкаДокумента = "МестоЗаправкиКод" Тогда
			ТекСтрока.Использование		 = Истина;
			ТекСтрока.НомерКолонкиФайла	 = 7;
			ТекСтрока.ИмяКолонкиФайла	 = "АЗС";
		ИначеЕсли ТекСтрока.КолонкаДокумента = "МестоЗаправкиКод" Тогда
			ТекСтрока.Использование		 = Истина;
			ТекСтрока.НомерКолонкиФайла	 = 7;
			ТекСтрока.ИмяКолонкиФайла	 = "АЗС";
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ИнициализацияСоответствияКолонокСистемаВзиманияПлаты(Объект)

	Если Объект.ВнешняяСистема = Справочники.уатВнешниеСистемы.Платон Тогда
		
		НоваяСтрока = Объект.СоответствиеКолонок.Добавить();
		НоваяСтрока.КолонкаДокумента = "ДатаОперации";
		НоваяСтрока.КолонкаДокументаПредставление = "Дата операции";
		
		НоваяСтрока = Объект.СоответствиеКолонок.Добавить();
		НоваяСтрока.КолонкаДокумента = "УникальныйНомерОперации";
		НоваяСтрока.КолонкаДокументаПредставление = "Уникальный номер операции";
		
		НоваяСтрока = Объект.СоответствиеКолонок.Добавить();
		НоваяСтрока.КолонкаДокумента = "ТипОперации";
		НоваяСтрока.КолонкаДокументаПредставление = "Тип операции";
		
		НоваяСтрока = Объект.СоответствиеКолонок.Добавить();
		НоваяСтрока.КолонкаДокумента = "ГРЗТС";
		НоваяСтрока.КолонкаДокументаПредставление = "ГРЗ ТС";
		
		НоваяСтрока = Объект.СоответствиеКолонок.Добавить();
		НоваяСтрока.КолонкаДокумента = "ТС";
		НоваяСтрока.КолонкаДокументаПредставление = "ТС";
		
		НоваяСтрока = Объект.СоответствиеКолонок.Добавить();
		НоваяСтрока.КолонкаДокумента = "ПутьПройденныйТС";
		НоваяСтрока.КолонкаДокументаПредставление = "Путь, пройденный ТС по дорогам (км)";
		
		НоваяСтрока = Объект.СоответствиеКолонок.Добавить();
		НоваяСтрока.КолонкаДокумента = "ЗачислениеНаРЗ";
		НоваяСтрока.КолонкаДокументаПредставление = "Зачисление на РЗ (руб.)";
		
		НоваяСтрока = Объект.СоответствиеКолонок.Добавить();
		НоваяСтрока.КолонкаДокумента = "СписаниеСРЗ";
		НоваяСтрока.КолонкаДокументаПредставление = "Списание с РЗ (руб.)";
		
		НоваяСтрока = Объект.СоответствиеКолонок.Добавить();
		НоваяСтрока.КолонкаДокумента = "НомерБУМК";
		НоваяСтрока.КолонкаДокументаПредставление = "Номер БУ/МК";
		
		НоваяСтрока = Объект.СоответствиеКолонок.Добавить();
		НоваяСтрока.КолонкаДокумента = "ДатаВремяНачалаДвижения";
		НоваяСтрока.КолонкаДокументаПредставление = "Дата и время начала движения";
		
		НоваяСтрока = Объект.СоответствиеКолонок.Добавить();
		НоваяСтрока.КолонкаДокумента = "ДатаВремяОкончанияДвижения";
		НоваяСтрока.КолонкаДокументаПредставление = "Дата и время окончания движения";
		
		НоваяСтрока = Объект.СоответствиеКолонок.Добавить();
		НоваяСтрока.КолонкаДокумента = "НаименованиеАвтомобильнойДороги";
		НоваяСтрока.КолонкаДокументаПредставление = "Наименование дороги";
		
		НоваяСтрока = Объект.СоответствиеКолонок.Добавить();
		НоваяСтрока.КолонкаДокумента = "КоординатыВъездаНаТарифицируемыйУчасток";
		НоваяСтрока.КолонкаДокументаПредставление = "Координаты въезда на тар. участок";
		
		НоваяСтрока = Объект.СоответствиеКолонок.Добавить();
		НоваяСтрока.КолонкаДокумента = "КоординатыСъездаСТарифицируемогоУчастка";
		НоваяСтрока.КолонкаДокументаПредставление = "Координаты съезда с тар. участка";
		
	ИначеЕсли Объект.ВнешняяСистема = Справочники.уатВнешниеСистемы.Автодор Тогда 
		
		НоваяСтрока = Объект.СоответствиеКолонок.Добавить();
		НоваяСтрока.КолонкаДокумента = "ДатаОперации";
		НоваяСтрока.КолонкаДокументаПредставление = "Дата операции";
		
		НоваяСтрока = Объект.СоответствиеКолонок.Добавить();
		НоваяСтрока.КолонкаДокумента = "ЭлектронноеСредство";
		НоваяСтрока.КолонкаДокументаПредставление = "Электронное средство";
		
		НоваяСтрока = Объект.СоответствиеКолонок.Добавить();
		НоваяСтрока.КолонкаДокумента = "ПунктОплаты";
		НоваяСтрока.КолонкаДокументаПредставление = "Пункт оплаты";
		
		НоваяСтрока = Объект.СоответствиеКолонок.Добавить();
		НоваяСтрока.КолонкаДокумента = "Полоса";
		НоваяСтрока.КолонкаДокументаПредставление = "Полоса";
		
		НоваяСтрока = Объект.СоответствиеКолонок.Добавить();
		НоваяСтрока.КолонкаДокумента = "Класс";
		НоваяСтрока.КолонкаДокументаПредставление = "Класс";
		
		НоваяСтрока = Объект.СоответствиеКолонок.Добавить();
		НоваяСтрока.КолонкаДокумента = "Сумма";
		НоваяСтрока.КолонкаДокументаПредставление = "Сумма";
		
		НоваяСтрока = Объект.СоответствиеКолонок.Добавить();
		НоваяСтрока.КолонкаДокумента = "Примечание";
		НоваяСтрока.КолонкаДокументаПредставление = "Примечание";
				
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализацияСоответствияКолонокПлатонВыпискаОпераций(Объект) Экспорт

	Для Каждого ТекСтрока Из Объект.СоответствиеКолонок Цикл
		Если ТекСтрока.КолонкаДокумента = "ДатаОперации" Тогда
			ТекСтрока.Использование		 = Истина;
			ТекСтрока.НомерКолонкиФайла	 = 1;
		ИначеЕсли ТекСтрока.КолонкаДокумента = "УникальныйНомерОперации" Тогда
			ТекСтрока.Использование		 = Истина;
			ТекСтрока.НомерКолонкиФайла	 = 2;
		ИначеЕсли ТекСтрока.КолонкаДокумента = "ТипОперации" Тогда
			ТекСтрока.Использование		 = Истина;
			ТекСтрока.НомерКолонкиФайла	 = 3;
		ИначеЕсли ТекСтрока.КолонкаДокумента = "ГРЗТС" Тогда
			ТекСтрока.Использование		 = Истина;
			ТекСтрока.НомерКолонкиФайла	 = 4;
		ИначеЕсли ТекСтрока.КолонкаДокумента = "ПутьПройденныйТС" Тогда
			ТекСтрока.Использование		 = Истина;
			ТекСтрока.НомерКолонкиФайла	 = 5;
		ИначеЕсли ТекСтрока.КолонкаДокумента = "ЗачислениеНаРЗ" Тогда
			ТекСтрока.Использование		 = Истина;
			ТекСтрока.НомерКолонкиФайла	 = 6;
		ИначеЕсли ТекСтрока.КолонкаДокумента = "СписаниеСРЗ" Тогда
			ТекСтрока.Использование		 = Истина;
			ТекСтрока.НомерКолонкиФайла	 = 7;
		ИначеЕсли ТекСтрока.КолонкаДокумента = "НомерБУМК" Тогда
			ТекСтрока.Использование		 = Истина;
			ТекСтрока.НомерКолонкиФайла	 = 8;
		ИначеЕсли ТекСтрока.КолонкаДокумента = "ДатаВремяНачалаДвижения" Тогда
			ТекСтрока.Использование		 = Истина;
			ТекСтрока.НомерКолонкиФайла	 = 9;
		ИначеЕсли ТекСтрока.КолонкаДокумента = "ДатаВремяОкончанияДвижения" Тогда
			ТекСтрока.Использование		 = Истина;
			ТекСтрока.НомерКолонкиФайла	 = 10;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ИнициализацияСоответствияКолонокПлатонЛогистическийОтчет(Объект) Экспорт

	Для Каждого ТекСтрока Из Объект.СоответствиеКолонок Цикл
		Если ТекСтрока.КолонкаДокумента = "ДатаВремяНачалаДвижения" Тогда
			ТекСтрока.Использование		 = Истина;
			ТекСтрока.НомерКолонкиФайла	 = 1;
		ИначеЕсли ТекСтрока.КолонкаДокумента = "ДатаВремяОкончанияДвижения" Тогда
			ТекСтрока.Использование		 = Истина;
			ТекСтрока.НомерКолонкиФайла	 = 2;
		ИначеЕсли ТекСтрока.КолонкаДокумента = "ГРЗТС" Тогда
			ТекСтрока.Использование		 = Истина;
			ТекСтрока.НомерКолонкиФайла	 = 3;
		ИначеЕсли ТекСтрока.КолонкаДокумента = "НомерБУМК" Тогда
			ТекСтрока.Использование		 = Истина;
			ТекСтрока.НомерКолонкиФайла	 = 4;
		ИначеЕсли ТекСтрока.КолонкаДокумента = "ПутьПройденныйТС" Тогда
			ТекСтрока.Использование		 = Истина;
			ТекСтрока.НомерКолонкиФайла	 = 5;
		ИначеЕсли ТекСтрока.КолонкаДокумента = "НаименованиеАвтомобильнойДороги" Тогда
			ТекСтрока.Использование		 = Истина;
			ТекСтрока.НомерКолонкиФайла	 = 6;
		ИначеЕсли ТекСтрока.КолонкаДокумента = "КоординатыВъездаНаТарифицируемыйУчасток" Тогда
			ТекСтрока.Использование		 = Истина;
			ТекСтрока.НомерКолонкиФайла	 = 7;
		ИначеЕсли ТекСтрока.КолонкаДокумента = "КоординатыСъездаСТарифицируемогоУчастка" Тогда
			ТекСтрока.Использование		 = Истина;
			ТекСтрока.НомерКолонкиФайла	 = 8;
		ИначеЕсли ТекСтрока.КолонкаДокумента = "УникальныйНомерОперации" Тогда
			ТекСтрока.Использование		 = Истина;
			ТекСтрока.НомерКолонкиФайла	 = 9;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ИнициализацияСоответствияКолонокАвтодор(Объект) Экспорт
	
	Для Каждого ТекСтрока Из Объект.СоответствиеКолонок Цикл
		Если ТекСтрока.КолонкаДокумента = "ДатаОперации" Тогда
			ТекСтрока.Использование		 = Истина;
			ТекСтрока.НомерКолонкиФайла	 = 1;
		ИначеЕсли ТекСтрока.КолонкаДокумента = "ЭлектронноеСредство" Тогда
			ТекСтрока.Использование		 = Истина;
			ТекСтрока.НомерКолонкиФайла	 = 2;
		ИначеЕсли ТекСтрока.КолонкаДокумента = "ПунктОплаты" Тогда
			ТекСтрока.Использование		 = Истина;
			ТекСтрока.НомерКолонкиФайла	 = 3;
		ИначеЕсли ТекСтрока.КолонкаДокумента = "Полоса" Тогда
			ТекСтрока.Использование		 = Истина;
			ТекСтрока.НомерКолонкиФайла	 = 4;
		ИначеЕсли ТекСтрока.КолонкаДокумента = "Класс" Тогда
			ТекСтрока.Использование		 = Истина;
			ТекСтрока.НомерКолонкиФайла	 = 5;
		ИначеЕсли ТекСтрока.КолонкаДокумента = "Сумма" Тогда
			ТекСтрока.Использование		 = Истина;
			ТекСтрока.НомерКолонкиФайла	 = 6;
		ИначеЕсли ТекСтрока.КолонкаДокумента = "Примечание" Тогда
			ТекСтрока.Использование		 = Истина;
			ТекСтрока.НомерКолонкиФайла	 = 7;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
